---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.IsFooterSectionHidden
source: html/3998d37a-3293-5fe8-866d-96993fae4f49.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.IsFooterSectionHidden Property

True if the user wishes to hide the footer section; setting this value must go through the appropriate update function

## Syntax (C#)
```csharp
public bool IsFooterSectionHidden { get; }
```